# ExportLineweightKey Constructor (ExportLineweightKey)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightKey Constructor (ExportLineweightKey)
ExportLineweightKey Class See Also
---
Constructs a new copy of the input ExportLineweightKey object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLineweightKey(
	ExportLineweightKey other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ExportLineweightKey _
)
```

Visual C++
---
```text
public:
ExportLineweightKey(
	ExportLineweightKey^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ExportLineweightKey
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLineweightKey Class
ExportLineweightKey Overload
Autodesk.Revit.DB Namespace